app/Services/AuditLogService.php

    public function register(string $action, ?string $detail = null, ?int $userId = null): void
    {
        $this->logModel->insert([
            'usuario_id'  => $userId,
            'accion'      => $action,
            'detalle'     => $detail,
            'ip_address'  => service('request')->getIPAddress(),
            'created_at'  => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `logs` (`usuario_id`, `accion`, `detalle`, `ip_address`, `created_at`) VALUES (1, 'CAMBIO_ESTADO_PREGUNTA', 'Pregunta ID 1 activa=0', '172.18.0.1', '2026-04-23 05:09:26')