app/Services/DashboardService.php

    public function getData(): array
    {
        $today = date('Y-m-d');
        $weekStart = date('Y-m-d', strtotime('monday this week'));
        $weekEnd = date('Y-m-d', strtotime('sunday this week'));

        $totalToday = $this->db->table('encuestas')
            ->where('DATE(created_at)', $today)
            ->countAllResults();

        $totalWeek = $this->db->table('encuestas')
            ->where('DATE(created_at) >=', $weekStart)
            ->where('DATE(created_at) <=', $weekEnd)
            ->countAllResults();

        $overallAvg = $this->db->table('respuestas')
            ->selectAvg('calificacion', 'promedio')
            ->get()
            ->getRowArray();

        $latestAnswers = $this->db->table('respuestas r')
            ->select('r.calificacion, r.created_at, p.pregunta, s.nombre AS sucursal')
            ->join('preguntas p', 'p.id = r.pregunta_id')
            ->join('encuestas e', 'e.id = r.encuesta_id')
            ->join('sucursales s', 's.id = e.sucursal_id')
            ->orderBy('r.id', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();

        $branchAverages = $this->db->table('respuestas r')
            ->select('s.nombre, AVG(r.calificacion) AS promedio')
            ->join('encuestas e', 'e.id = r.encuesta_id')
            ->join('sucursales s', 's.id = e.sucursal_id')
            ->groupBy('e.sucursal_id')
            ->orderBy('promedio', 'DESC')
            ->get()
            ->getResultArray();

        $worstQuestions = $this->db->table('respuestas r')
            ->select('p.pregunta, AVG(r.calificacion) AS promedio, COUNT(*) AS total')
            ->join('preguntas p', 'p.id = r.pregunta_id')
            ->groupBy('r.pregunta_id')
            ->having('COUNT(*) >', 0)
            ->orderBy('promedio', 'ASC')
            ->limit(5)
            ->get()
            ->getResultArray();

        $recentComments = $this->db->table('encuestas')
            ->select('comentario_final, created_at')
            ->where('comentario_final IS NOT NULL')
            ->where('comentario_final !=', '')
            ->orderBy('id', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `encuestas`
WHERE DATE(created_at) = '2026-04-23'
SELECT COUNT(*) AS `numrows`
FROM `encuestas`
WHERE DATE(created_at) >= '2026-04-20'
AND DATE(created_at) <= '2026-04-26'
SELECT AVG(`calificacion`) AS `promedio`
FROM `respuestas`
SELECT `r`.`calificacion`, `r`.`created_at`, `p`.`pregunta`, `s`.`nombre` AS `sucursal`
FROM `respuestas` `r`
JOIN `preguntas` `p` ON `p`.`id` = `r`.`pregunta_id`
JOIN `encuestas` `e` ON `e`.`id` = `r`.`encuesta_id`
JOIN `sucursales` `s` ON `s`.`id` = `e`.`sucursal_id`
ORDER BY `r`.`id` DESC
 LIMIT 10
SELECT `s`.`nombre`, AVG(r.calificacion) AS promedio
FROM `respuestas` `r`
JOIN `encuestas` `e` ON `e`.`id` = `r`.`encuesta_id`
JOIN `sucursales` `s` ON `s`.`id` = `e`.`sucursal_id`
GROUP BY `e`.`sucursal_id`
ORDER BY `promedio` DESC
SELECT `p`.`pregunta`, AVG(r.calificacion) AS promedio, COUNT(*) AS total
FROM `respuestas` `r`
JOIN `preguntas` `p` ON `p`.`id` = `r`.`pregunta_id`
GROUP BY `r`.`pregunta_id`
HAVING COUNT(*) > 0
ORDER BY `promedio` ASC
 LIMIT 5
SELECT `comentario_final`, `created_at`
FROM `encuestas`
WHERE `comentario_final` IS NOT NULL
AND `comentario_final` != ''
ORDER BY `id` DESC
 LIMIT 10