app/Services/ReportService.php

    public function build(array $filters): array
    {
        $from = $filters['from'] ?? date('Y-m-01');
        $to = $filters['to'] ?? date('Y-m-d');
        $branchId = isset($filters['sucursal_id']) && $filters['sucursal_id'] !== '' ? (int) $filters['sucursal_id'] : null;

        $base = $this->db->table('respuestas r')
            ->join('encuestas e', 'e.id = r.encuesta_id');

        $this->applyFilters($base, $from, $to, $branchId);

        $totalAnswers = $base->countAllResults(false);
        $overallRow = $base->selectAvg('r.calificacion', 'promedio')->get()->getRowArray();
        $overall = $overallRow['promedio'] ? round((float) $overallRow['promedio'], 2) : 0;

        $perQuestion = $this->db->table('respuestas r')
            ->select('p.pregunta, p.categoria, AVG(r.calificacion) AS promedio, COUNT(*) AS total')
            ->join('encuestas e', 'e.id = r.encuesta_id')
            ->join('preguntas p', 'p.id = r.pregunta_id');
        $this->applyFilters($perQuestion, $from, $to, $branchId);
        $perQuestion = $perQuestion
            ->groupBy('r.pregunta_id')
            ->orderBy('promedio', 'DESC')
            ->get()
            ->getResultArray();

        $weeklyTrend = $this->db->table('respuestas r')
            ->select("YEARWEEK(e.created_at, 1) AS semana, AVG(r.calificacion) AS promedio, COUNT(*) AS total", false)
            ->join('encuestas e', 'e.id = r.encuesta_id');
        $this->applyFilters($weeklyTrend, $from, $to, $branchId);
        $weeklyTrend = $weeklyTrend
            ->groupBy('semana')
            ->orderBy('semana', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `respuestas` `r`
JOIN `encuestas` `e` ON `e`.`id` = `r`.`encuesta_id`
WHERE DATE(e.created_at) >= '2026-04-01'
AND DATE(e.created_at) <= '2026-04-23'
SELECT AVG(`r`.`calificacion`) AS `promedio`
FROM `respuestas` `r`
JOIN `encuestas` `e` ON `e`.`id` = `r`.`encuesta_id`
WHERE DATE(e.created_at) >= '2026-04-01'
AND DATE(e.created_at) <= '2026-04-23'
SELECT `p`.`pregunta`, `p`.`categoria`, AVG(r.calificacion) AS promedio, COUNT(*) AS total
FROM `respuestas` `r`
JOIN `encuestas` `e` ON `e`.`id` = `r`.`encuesta_id`
JOIN `preguntas` `p` ON `p`.`id` = `r`.`pregunta_id`
WHERE DATE(e.created_at) >= '2026-04-01'
AND DATE(e.created_at) <= '2026-04-23'
GROUP BY `r`.`pregunta_id`
ORDER BY `promedio` DESC
SELECT YEARWEEK(e.created_at, 1) AS semana, AVG(r.calificacion) AS promedio, COUNT(*) AS total
FROM `respuestas` `r`
JOIN `encuestas` `e` ON `e`.`id` = `r`.`encuesta_id`
WHERE DATE(e.created_at) >= '2026-04-01'
AND DATE(e.created_at) <= '2026-04-23'
GROUP BY `semana`
ORDER BY `semana` ASC

            'totals' => [
                'total_respuestas' => $totalAnswers,
                'promedio_general' => $overall,
                'total_encuestas' => $surveysCount->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `encuestas` `e`
WHERE DATE(e.created_at) >= '2026-04-01'
AND DATE(e.created_at) <= '2026-04-23'